In [3]:
# import data analysis libraries 
import pandas as pd
import numpy as np

In [2]:
# let us create a dataframe i.e a table with head row & values for each column

dict1 = {
    "name" : ["amit", "rohan", "skillf", "shubh"],
    "marks": [92, 34, 24, 17],
    "city": ['rampur', 'kolkata', 'bareilly', ' antarctica']
}

In [8]:
# now the dataframes is like an exel sheet, converting to excel sheet, for faster indexing
dataframes = pd.DataFrame(dict1);

In [35]:
# printing the dataframes
print(dataframes);
# type of dataframe = 'pandas.core.frame.DataFrame'
print(type(dataframes));

     name  marks         city
0    amit     92       rampur
1   rohan     34      kolkata
2  skillf     24     bareilly
3   shubh     17   antarctica
<class 'pandas.core.frame.DataFrame'>

In [23]:
dataframes

     name  marks         city
0    amit     92       rampur
1   rohan     34      kolkata
2  skillf     24     bareilly
3   shubh     17   antarctica

In [16]:
# now exporting the dataframes as excel/csv file

dataframes.to_csv("studMarks.csv");

In [17]:
# exporting the dataframes as csv file without indexing
dataframes.to_csv("studMarks_index_false.csv", index=False);

In [37]:
# to see few rows from 1st or last when data is very big

# will show 1st 2 rows/indexes
top = dataframes.head(2);
print(top);

# Note: due to Semicolon output of the cell is supressed, so remove the semicolon to see the output
dataframes.head(2)

    name  marks     city
0   amit     92   rampur
1  rohan     34  kolkata

    name  marks     city
0   amit     92   rampur
1  rohan     34  kolkata

In [38]:
# will show 1st 2 rows/indexes
dataframes.tail(2)

     name  marks         city
2  skillf     24     bareilly
3   shubh     17   antarctica

In [40]:
# statistics of dataframes

# will show all the statistical data of Numberical rows of the dataframes
dataframes.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [46]:
# to read a csv file

# pd = pandas
file = pd.read_csv("trainTicket.csv")

In [47]:
file

   Train id  speed         city
0      1210     21       rampur
1      3231     43      kolkata
2      4432    123     bareilly
3      3422     17   antarctica

In [49]:
# to access a particular column
file['speed']

0     21
1     43
2    123
3     17
Name: speed, dtype: int64

In [50]:
# to access a particular cell value of the dataframe
file['speed'][0]

21

In [51]:
# to change the value of a particular cell

# not recommended
file['speed'][0] = 100

C:\Users\shivh\AppData\Local\Temp\ipykernel_9756\2057342337.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file['speed'][0] = 100

In [55]:
# now we have to update the value into the file also
# so save the dataframe with same filename but first see if the file is already open
file.to_csv('trainTicket.csv');

In [58]:
# to change the indexes 
# can be string or any numeric value

file.index = ['one', 'two', 'three', 'four']

In [59]:
file

       Train id  speed         city
one        1210    100       rampur
two        3231     43      kolkata
three      4432    123     bareilly
four       3422     17   antarctica